tap "chipsalliance/verible"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "louisbrunner/valgrind"
tap "randomplum/gtkwave"
brew "ack"
brew "xz"
brew "bat"
brew "bat-extras"
brew "catch2"
brew "cheat"
brew "chezmoi"
brew "gnutls"
brew "colima", restart_service: true
brew "coreutils"
brew "d2"
brew "eza"
brew "pango"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "go"
brew "icarus-verilog"
brew "libyaml"
brew "lighttpd"
brew "mas"
brew "node"
brew "openblas"
brew "numpy"
brew "perl"
brew "uvicorn"
brew "platformio"
brew "py3cairo"
brew "pyenv"
brew "qt@5"
brew "ruby"
brew "scipy"
brew "shfmt"
brew "spim"
brew "tcl-tk"
brew "tldr"
brew "tree"
brew "ugrep"
brew "yosys"
brew "zlib"
brew "chipsalliance/verible/verible"
brew "randomplum/gtkwave/gtkwave", args: ["HEAD"]
cask "1password"
cask "adobe-acrobat-pro"
cask "adobe-creative-cloud"
cask "alt-tab"
cask "arc"
cask "breaktimer"
cask "chatbox"
cask "cleanshot"
cask "cyberduck"
cask "discord"
cask "ghidra"
cask "google-chrome"
cask "heynote"
cask "imazing-profile-editor"
cask "kap"
cask "macgpt"
cask "mactex-no-gui"
cask "mimestream"
cask "mindmac"
cask "mullvad-browser"
cask "numi"
cask "obsidian"
cask "popclip"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "skype"
cask "temurin"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zotero"
vscode "AngaBlue.asm-formatter"
vscode "chipsalliance.verible"
vscode "cschlosser.doxdocgen"
vscode "dksedgwick.xstviz"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "hediet.debug-visualizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kdarkhan.mips"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "PenumbraTheme.penumbra"
vscode "Rickaym.manim-sideview"
vscode "teros-technology.teroshdl"
vscode "timonwong.shellcheck"
vscode "tzylee.verilog-highlight"
vscode "wavetrace.wavetrace"
vscode "Willumz.generic-pseudocode"
