IlanCosman/tide@v6
franciscolourenco/done
gazorby/fish-abbreviation-tips
jamiesteven/fish-plugin-lsd
jorgebucaran/autopair.fish
markcial/upto
meaningful-ooo/sponge
oh-my-fish/plugin-pj
otms61/fish-pet
patrickF1/fzf.fish
patrickf1/colored_man_pages.fish
joseluisq/gitnow@2.12.0
